In [83]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt 
from sklearn.preprocessing import MinMaxScaler

In [84]:
df = pd.DataFrame()

In [85]:
df['a'] = [1,2,3,4,5,6]
df['b'] = [29,30,45,34,23,15]
df['c'] = [1,np.nan,None,None,None,6]

In [86]:
df

   a   b    c
0  1  29  1.0
1  2  30  NaN
2  3  45  NaN
3  4  34  NaN
4  5  23  NaN
5  6  15  6.0

In [87]:
scaler =MinMaxScaler(feature_range=(0,1))
df2 = scaler.fit_transform(df)

In [88]:
df2

array([[0.        , 0.46666667, 0.        ],
       [0.2       , 0.5       ,        nan],
       [0.4       , 1.        ,        nan],
       [0.6       , 0.63333333,        nan],
       [0.8       , 0.26666667,        nan],
       [1.        , 0.        , 1.        ]])

In [89]:
scaler.transform(df)

array([[0.        , 0.46666667, 0.        ],
       [0.2       , 0.5       ,        nan],
       [0.4       , 1.        ,        nan],
       [0.6       , 0.63333333,        nan],
       [0.8       , 0.26666667,        nan],
       [1.        , 0.        , 1.        ]])

In [90]:
scaler.data_range_

array([ 5., 30.,  5.])

In [91]:
scaler.feature_range

(0, 1)

In [92]:
scaler.get_params()

{'clip': False, 'copy': True, 'feature_range': (0, 1)}

In [93]:
df2

array([[0.        , 0.46666667, 0.        ],
       [0.2       , 0.5       ,        nan],
       [0.4       , 1.        ,        nan],
       [0.6       , 0.63333333,        nan],
       [0.8       , 0.26666667,        nan],
       [1.        , 0.        , 1.        ]])

In [94]:
df

   a   b    c
0  1  29  1.0
1  2  30  NaN
2  3  45  NaN
3  4  34  NaN
4  5  23  NaN
5  6  15  6.0

In [99]:
df2 = df.values.reshape(df.shape[0],1,df.shape[1])
df2

array([[[ 1., 29.,  1.]],

       [[ 2., 30., nan]],

       [[ 3., 45., nan]],

       [[ 4., 34., nan]],

       [[ 5., 23., nan]],

       [[ 6., 15.,  6.]]])

In [100]:
df2.shape

(6, 1, 3)

In [103]:
df.shape

(6, 3)

In [101]:
df.values.reshape(df.shape[0],1,df.shape[1])

array([[[ 1., 29.,  1.]],

       [[ 2., 30., nan]],

       [[ 3., 45., nan]],

       [[ 4., 34., nan]],

       [[ 5., 23., nan]],

       [[ 6., 15.,  6.]]])

In [104]:
df

   a   b    c
0  1  29  1.0
1  2  30  NaN
2  3  45  NaN
3  4  34  NaN
4  5  23  NaN
5  6  15  6.0

In [105]:
df.interpolate()

   a   b    c
0  1  29  1.0
1  2  30  2.0
2  3  45  3.0
3  4  34  4.0
4  5  23  5.0
5  6  15  6.0

In [106]:
index = pd.date_range('1/1/2000', periods=9, freq='T')

In [107]:
series = pd.Series(range(9), index=index)
series

2000-01-01 00:00:00    0
2000-01-01 00:01:00    1
2000-01-01 00:02:00    2
2000-01-01 00:03:00    3
2000-01-01 00:04:00    4
2000-01-01 00:05:00    5
2000-01-01 00:06:00    6
2000-01-01 00:07:00    7
2000-01-01 00:08:00    8
Freq: T, dtype: int64

In [108]:
series.resample('3T').max()

2000-01-01 00:00:00    2
2000-01-01 00:03:00    5
2000-01-01 00:06:00    8
Freq: 3T, dtype: int64

In [109]:
series.resample('3T', label='right').sum()

2000-01-01 00:03:00     3
2000-01-01 00:06:00    12
2000-01-01 00:09:00    21
Freq: 3T, dtype: int64

In [110]:
series.resample('3T').sum()

2000-01-01 00:00:00     3
2000-01-01 00:03:00    12
2000-01-01 00:06:00    21
Freq: 3T, dtype: int64

In [111]:
series

2000-01-01 00:00:00    0
2000-01-01 00:01:00    1
2000-01-01 00:02:00    2
2000-01-01 00:03:00    3
2000-01-01 00:04:00    4
2000-01-01 00:05:00    5
2000-01-01 00:06:00    6
2000-01-01 00:07:00    7
2000-01-01 00:08:00    8
Freq: T, dtype: int64

In [112]:
series.resample('30S').pad()

2000-01-01 00:00:00    0
2000-01-01 00:00:30    0
2000-01-01 00:01:00    1
2000-01-01 00:01:30    1
2000-01-01 00:02:00    2
2000-01-01 00:02:30    2
2000-01-01 00:03:00    3
2000-01-01 00:03:30    3
2000-01-01 00:04:00    4
2000-01-01 00:04:30    4
2000-01-01 00:05:00    5
2000-01-01 00:05:30    5
2000-01-01 00:06:00    6
2000-01-01 00:06:30    6
2000-01-01 00:07:00    7
2000-01-01 00:07:30    7
2000-01-01 00:08:00    8
Freq: 30S, dtype: int64

In [113]:
series.resample('30S').bfill()

2000-01-01 00:00:00    0
2000-01-01 00:00:30    1
2000-01-01 00:01:00    1
2000-01-01 00:01:30    2
2000-01-01 00:02:00    2
2000-01-01 00:02:30    3
2000-01-01 00:03:00    3
2000-01-01 00:03:30    4
2000-01-01 00:04:00    4
2000-01-01 00:04:30    5
2000-01-01 00:05:00    5
2000-01-01 00:05:30    6
2000-01-01 00:06:00    6
2000-01-01 00:06:30    7
2000-01-01 00:07:00    7
2000-01-01 00:07:30    8
2000-01-01 00:08:00    8
Freq: 30S, dtype: int64

In [114]:
series.resample('10S').bfill()

2000-01-01 00:00:00    0
2000-01-01 00:00:10    1
2000-01-01 00:00:20    1
2000-01-01 00:00:30    1
2000-01-01 00:00:40    1
2000-01-01 00:00:50    1
2000-01-01 00:01:00    1
2000-01-01 00:01:10    2
2000-01-01 00:01:20    2
2000-01-01 00:01:30    2
2000-01-01 00:01:40    2
2000-01-01 00:01:50    2
2000-01-01 00:02:00    2
2000-01-01 00:02:10    3
2000-01-01 00:02:20    3
2000-01-01 00:02:30    3
2000-01-01 00:02:40    3
2000-01-01 00:02:50    3
2000-01-01 00:03:00    3
2000-01-01 00:03:10    4
2000-01-01 00:03:20    4
2000-01-01 00:03:30    4
2000-01-01 00:03:40    4
2000-01-01 00:03:50    4
2000-01-01 00:04:00    4
2000-01-01 00:04:10    5
2000-01-01 00:04:20    5
2000-01-01 00:04:30    5
2000-01-01 00:04:40    5
2000-01-01 00:04:50    5
2000-01-01 00:05:00    5
2000-01-01 00:05:10    6
2000-01-01 00:05:20    6
2000-01-01 00:05:30    6
2000-01-01 00:05:40    6
2000-01-01 00:05:50    6
2000-01-01 00:06:00    6
2000-01-01 00:06:10    7
2000-01-01 00:06:20    7
2000-01-01 00:06:30    7
2000-01-01 00:06:40    7
2000-01-01 00:06:50    7
2000-01-01 00:07:00    7
2000-01-01 00:07:10    8
2000-01-01 00:07:20    8
2000-01-01 00:07:30    8
2000-01-01 00:07:40    8
2000-01-01 00:07:50    8
2000-01-01 00:08:00    8
Freq: 10S, dtype: int64

In [115]:
series.resample('5s').interpolate()

2000-01-01 00:00:00    0.000000
2000-01-01 00:00:05    0.083333
2000-01-01 00:00:10    0.166667
2000-01-01 00:00:15    0.250000
2000-01-01 00:00:20    0.333333
                         ...
2000-01-01 00:07:40    7.666667
2000-01-01 00:07:45    7.750000
2000-01-01 00:07:50    7.833333
2000-01-01 00:07:55    7.916667
2000-01-01 00:08:00    8.000000
Freq: 5S, Length: 97, dtype: float64

In [116]:
import numpy as np

In [117]:
a = np.array([1,2])
a

array([1, 2])

In [118]:
a.shape

(2,)

In [122]:
b = a[np.newaxis]
b

array([[1, 2]])

In [124]:
b.shape

(1, 2)

In [127]:
c = a[:,np.newaxis]
c

array([[1],
       [2]])

In [128]:
d = a[np.newaxis,:]
d

array([[1, 2]])

In [137]:
e = np.expand_dims(a,axis = 0)
e

array([[1, 2]])

In [130]:
np.expand_dims(a,axis = 1)

array([[1],
       [2]])

In [139]:
df

   a   b    c
0  1  29  1.0
1  2  30  NaN
2  3  45  NaN
3  4  34  NaN
4  5  23  NaN
5  6  15  6.0

In [144]:
f = np.expand_dims(df,axis =1)
f

array([[[ 1., 29.,  1.]],

       [[ 2., 30., nan]],

       [[ 3., 45., nan]],

       [[ 4., 34., nan]],

       [[ 5., 23., nan]],

       [[ 6., 15.,  6.]]])

In [146]:
f.shape

(6, 1, 3)

In [147]:
df

   a   b    c
0  1  29  1.0
1  2  30  NaN
2  3  45  NaN
3  4  34  NaN
4  5  23  NaN
5  6  15  6.0

In [150]:
df.flags

In [151]:
df.rank()

     a    b    c
0  1.0  3.0  1.0
1  2.0  4.0  NaN
2  3.0  6.0  NaN
3  4.0  5.0  NaN
4  5.0  2.0  NaN
5  6.0  1.0  2.0